Add docs and fix duplicate send bug
